project-specification.org
#+TITLE: Transforming Education with Sustainable Development
#+AUTHOR: greppers
#+HTML_HEAD: <link rel="stylesheet" href="https://grtcdr.tn/stylesheets/main.css">
#+OPTIONS: html-postamble:nil

#+LATEX_HEADER: \usepackage{parskip}

* Abstract

This project and the applications that compose it should provide
unlimited access to our in-house cloud infrastructure. 

The application we intend to develop should follow a software as a
service (SaaS) model targeting one important resolution from the
United Nation's 2030 Agenda.

As such, access to the platform should be seamless and work on any
device, it should not require any maintenance nor installation from
the user. The application should also be able to handle large amounts
of traffic and the infrastructure should scale vertically and
horizontally as needed.

The infrastructure should imperatively follow an open source model and
utilize open source applications, offering orchestration capabilities
similar to those of the Microsoft Azure platform. Though, it should
not make any assumptions or depend on any specific hardware
configuration.

In case of any hardware failures, the pre-defined disaster recovery
plan should take effect, and in turn, the chances of a data
discrepancy or storage disk failure affecting the underlying
infrastructure dramatically decrease.

* Project Specification

** Cloud infrastructure
*** Functional requirements

- *What the system must do, and what its features are*

| Requirement                      | Description                                                                                                                                                                                            | Candidates                                   |
|----------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------------------------------------------|
| Multi-tenancy architecture       | The cloud infrastructure must support multiple concurrent users                                                                                                                                        | -                                            |
| Modularity                       | The cloud infrastructure should be based on a modular architecture such that its base components can be re-used across the platform which will consequently ease the debugging and development process | -                                            |
| Orchestration capabilities       | The cloud infrastructure must rely on orchestration tools such as Kubernetes, Docker Compose, Vagrant, Ansible to automate entire workflows.                                                           | Kubernetes, Docker Compose, Ansible, Vagrant |
| Hypervisors                      | The cloud infrastructure should support multiple hypervisors                                                                                                                                           | KVM, VMware, Xen, Hyper-V                    |
| Storage Redudancy                | The cloud infrastructure must utilize intelligent storage virtualization systems to be able to recover from any storage failures should they ever occur                                                | RAID, LVM                                    |
| Dashboard                        | The cloud infrastructure must allow users to manage their virtual machines through easy-to-use dashboards                                                                                              | Ovirt, Proxmox                               |
| Network-attached storage support | The cloud infrastructure must provide its users with the ability to create, manage and access network-attached storage servers                                                                         | NFS, SAMBA                                   |
| Load balancing                   | The cloud infrastructure must utilize load balancing software and techniques to distribute load across its underlying virtual machine clusters                                                         | Traefik, HAProxy, NGINX                      |

*** Non-functional requirements

| Requirement                         | Description                                                                                                                                                                   |
|-------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Open source model                   | The cloud infrastructure should be fully open source, this property alone welcomes new contributors which can help the project deliver its services to a much bigger audience |
| Support different deployment models | The cloud infrastructure should support both private and hybrid deployments                                                                                                   |
| Documentation and standardization   | The cloud infrastructure should be well documented and should have concise guidelines that seek to set standards for building massive and scalable clouds                     |
| High Availability                   | The cloud infrastructure should seek to be available as much as possible to its users, and as such, its uptime must never be <98%                                             |

** Adjacent software utilities

*** Optimizing virtual machine provisioning

Provisioning virtual machines is an astoundingly repetitive task for
any cloud infrastructure, however it remains one of the more
time-consuming tasks that can be performed.

We should explore a solution that addresses this challenge[fn:1], whilst
meeting the following criteria:
- Agentless architecture
- Provision, configure and deploy  
- Open source
- Cross platform
- Remote access via standardized communications protocols
  
*** Orchestrating the web application

The orchestration tool that manages the web application in question
should satisfy the following needs:

| Requirement                                         | Examples                                        |
|-----------------------------------------------------+-------------------------------------------------|
| Work across all Linux distribution                  | Docker, Podman                                  |
| Installable via configuration management tools      | Ansible                                         |
| Facilitate declarative configuration and automation | Nix                                             |
| Service discovery and load balancing                | Traefik                                         |
| Self-healing capabilities                           | Kubernetes                                      |
| Provide deployment patterns and templates           | Proxmox (GUI), qemu-img with virt-sysprep (CLI) |
  
* Footnotes

[fn:1] https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8684951 
