project-specification.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-09 Wed 10:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Transforming Education with Sustainable Development</title>
<meta name="author" content="greppers" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://grtcdr.tn/stylesheets/main.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Transforming Education with Sustainable Development</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3283c18">1. Abstract</a></li>
<li><a href="#org70f9d4f">2. Project Specification</a>
<ul>
<li><a href="#orgff573ff">2.1. Cloud infrastructure</a>
<ul>
<li><a href="#orgfa432f1">2.1.1. Functional requirements</a></li>
<li><a href="#orgbe65d29">2.1.2. Non-functional requirements</a></li>
</ul>
</li>
<li><a href="#org6bf873d">2.2. Adjacent software utilities</a>
<ul>
<li><a href="#orgdff301c">2.2.1. Optimizing virtual machine provisioning</a></li>
<li><a href="#org096eaea">2.2.2. Orchestrating the web application</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3283c18" class="outline-2">
<h2 id="org3283c18"><span class="section-number-2">1.</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<p>
This project and the applications that compose it should provide
unlimited access to our in-house cloud infrastructure. 
</p>

<p>
The application we intend to develop should follow a software as a
service (SaaS) model targeting one important resolution from the
United Nation's 2030 Agenda.
</p>

<p>
As such, access to the platform should be seamless and work on any
device, it should not require any maintenance nor installation from
the user. The application should also be able to handle large amounts
of traffic and the infrastructure should scale vertically and
horizontally as needed.
</p>

<p>
The infrastructure should imperatively follow an open source model and
utilize open source applications, offering orchestration capabilities
similar to those of the Microsoft Azure platform. Though, it should
not make any assumptions or depend on any specific hardware
configuration.
</p>

<p>
In case of any hardware failures, the pre-defined disaster recovery
plan should take effect, and in turn, the chances of a data
discrepancy or storage disk failure affecting the underlying
infrastructure dramatically decrease.
</p>
</div>
</div>

<div id="outline-container-org70f9d4f" class="outline-2">
<h2 id="org70f9d4f"><span class="section-number-2">2.</span> Project Specification</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgff573ff" class="outline-3">
<h3 id="orgff573ff"><span class="section-number-3">2.1.</span> Cloud infrastructure</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgfa432f1" class="outline-4">
<h4 id="orgfa432f1"><span class="section-number-4">2.1.1.</span> Functional requirements</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li><b>What the system must do, and what its features are</b></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Requirement</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Candidates</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Multi-tenancy architecture</td>
<td class="org-left">The cloud infrastructure must support multiple concurrent users</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">Modularity</td>
<td class="org-left">The cloud infrastructure should be based on a modular architecture such that its base components can be re-used across the platform which will consequently ease the debugging and development process</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">Orchestration capabilities</td>
<td class="org-left">The cloud infrastructure must rely on orchestration tools such as Kubernetes, Docker Compose, Vagrant, Ansible to automate entire workflows.</td>
<td class="org-left">Kubernetes, Docker Compose, Ansible, Vagrant</td>
</tr>

<tr>
<td class="org-left">Hypervisors</td>
<td class="org-left">The cloud infrastructure should support multiple hypervisors</td>
<td class="org-left">KVM, VMware, Xen, Hyper-V</td>
</tr>

<tr>
<td class="org-left">Storage Redudancy</td>
<td class="org-left">The cloud infrastructure must utilize intelligent storage virtualization systems to be able to recover from any storage failures should they ever occur</td>
<td class="org-left">RAID, LVM</td>
</tr>

<tr>
<td class="org-left">Dashboard</td>
<td class="org-left">The cloud infrastructure must allow users to manage their virtual machines through easy-to-use dashboards</td>
<td class="org-left">Ovirt, Proxmox</td>
</tr>

<tr>
<td class="org-left">Network-attached storage support</td>
<td class="org-left">The cloud infrastructure must provide its users with the ability to create, manage and access network-attached storage servers</td>
<td class="org-left">NFS, SAMBA</td>
</tr>

<tr>
<td class="org-left">Load balancing</td>
<td class="org-left">The cloud infrastructure must utilize load balancing software and techniques to distribute load across its underlying virtual machine clusters</td>
<td class="org-left">Traefik</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgbe65d29" class="outline-4">
<h4 id="orgbe65d29"><span class="section-number-4">2.1.2.</span> Non-functional requirements</h4>
<div class="outline-text-4" id="text-2-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Requirement</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Open source model</td>
<td class="org-left">The cloud infrastructure should be fully open source, this property alone welcomes new contributors which can help the project deliver its services to a much bigger audience</td>
</tr>

<tr>
<td class="org-left">Support different deployment models</td>
<td class="org-left">The cloud infrastructure should support both private and hybrid deployments</td>
</tr>

<tr>
<td class="org-left">Documentation and standardization</td>
<td class="org-left">The cloud infrastructure should be well documented and should have concise guidelines that seek to set standards for building massive and scalable clouds</td>
</tr>

<tr>
<td class="org-left">High Availability</td>
<td class="org-left">The cloud infrastructure should seek to be available as much as possible to its users, and as such, its uptime must never be &lt;98%</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org6bf873d" class="outline-3">
<h3 id="org6bf873d"><span class="section-number-3">2.2.</span> Adjacent software utilities</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgdff301c" class="outline-4">
<h4 id="orgdff301c"><span class="section-number-4">2.2.1.</span> Optimizing virtual machine provisioning</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Provisioning virtual machines is an astoundingly repetitive task for
any cloud infrastructure, however it remains one of the more
time-consuming tasks that can be performed.
</p>

<p>
We should explore a solution that addresses this challenge<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>, whilst
meeting the following criteria:
</p>
<ul class="org-ul">
<li>Agentless architecture</li>
<li>Provision, configure and deploy</li>
<li>Open source</li>
<li>Cross platform</li>
<li>Remote access via standardized communications protocols</li>
</ul>
</div>
</div>

<div id="outline-container-org096eaea" class="outline-4">
<h4 id="org096eaea"><span class="section-number-4">2.2.2.</span> Orchestrating the web application</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
The orchestration tool that manages the web application in question
should satisfy the following needs:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Requirement</th>
<th scope="col" class="org-left">Examples</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Work across all Linux distribution</td>
<td class="org-left">Docker, Podman</td>
</tr>

<tr>
<td class="org-left">Installable via configuration management tools</td>
<td class="org-left">Ansible</td>
</tr>

<tr>
<td class="org-left">Facilitate declarative configuration and automation</td>
<td class="org-left">Nix</td>
</tr>

<tr>
<td class="org-left">Service discovery and load balancing</td>
<td class="org-left">Traefik</td>
</tr>

<tr>
<td class="org-left">Self-healing capabilities</td>
<td class="org-left">Kubernetes</td>
</tr>

<tr>
<td class="org-left">Provide deployment patterns and templates</td>
<td class="org-left">Proxmox (GUI), qemu-img with virt-sysprep (CLI)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8684951">https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8684951</a> 
</p></div></div>


</div>
</div></div>
</body>
</html>
